//
// Created by hanxx on 2018/4/3.
//

#include <stdio.h>
#include "Game.h"

//初始化道具
Prop propArray[]={
        {1, "子午七星剑",1,5,5000,Weapon,.minattack=50,.maxattack=100,"传说中的北斗七星陨石锻造"},
        {2, "长龙护甲",3,5,10000,Armor,.mindefence=20,.maxdefence=80,"这是皇帝的的金丝甲"},
        {3, "雨露琼浆",5,20,1000,Con,.minpower=100,.maxpower=100,"王母娘娘蟠桃所制"}
};

//初始化地图 8行8列
Map mapArray[8][8] = {
        {{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"}
        },
        {{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"}
        },
        {{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"}
        },
        {{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"}
        },
        {{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"}
        },
        {{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"}
        },
        {{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"}
        },
        {{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"},
                {1,"天山",1,{0.0},"这里是天山，修仙必备"},{1,"天山",1,{0.0},"这里是天山，修仙必备"}
        }
};

void Init(){

}

//显示测试
void Show(){
    //获取初始化元素
    int propCount = sizeof(propArray)/ sizeof(Prop);
    int i,j;
    printf("编号\t名称\t等级\t库存\t价格\t属性\t描述\n");
    for(i=0; i<propCount;i++){
        printf("%d\t%s\t%d\t%d\t%.0lf\t",propArray[i].id,propArray[i].name,propArray[i].leve,propArray[i].stock,propArray[i].price);
        //打印是攻击力还是防御等
        switch (propArray[i].type){
            case Weapon:   //武器
                printf("最小攻击力：%d\t最大攻击力:%d\t",propArray[i].minattack,propArray[i].maxattack);
                break;
            case Armor:
                printf("最小防御：%d\t最大防御:%d\t",propArray[i].mindefence,propArray[i].maxdefence);
                break;
            case Con:
                printf("回复血量：%d\t回复蓝量：%d\t",propArray[i].minpower,propArray[i].maxpower);
                break;
            default:
                printf("-------------------\n");
        }
        printf("%s\n",propArray[i].desc);
    }

    printf("-------------------打印地图---------------------\n");
    for (int i = 0; i < 8; i++) {   //控制行
        for (int j = 0; j <8 ; j++) {   //控制列
            printf("%-8s",mapArray[i][j].name);
        }
        printf("\n");
    }

}