#include <stdio.h>
#include <stdlib.h>
//背包
#include "backpack.h"

//引用backpack.c文件中的指针
extern Player *player;
extern Prop *prop;
/*文字版游戏*/

int main()
{
    Init(); //初始化

    //测试

    printf("***************************交易前************************\n");
    ShowProps();    //打印商品
    printf("-----------------------------------------------------\n");
    ShowPlays();    //打印玩家
    printf("-----------------------------------------------------\n");

    Trade(&player[0],1);
    Trade(&player[0],1);

    printf("***************************交易后************************\n");
    ShowProps();    //打印商品
    printf("-----------------------------------------------------\n");
    ShowPlays();    //打印玩家
    printf("-----------------------------------------------------\n");
    return 0;
}
